In [101]:
# 연습 문제
# *titanic 데이터셋에 다음 작업을 수행하시오.
import pandas as pd
import numpy as np

df = pd.read_csv('data/titanic/train.csv')

df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [13]:
# 1. 승선항구가 'C'인 자료만 추출하시오.
df[df['Embarked']=='C']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [14]:
# 2. SibSp + Parch 의 합이 0인 자료만 추출하시오.
df[df['SibSp']+df['Parch']==0]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [103]:
# 3. Pclass가 1인 자료만 추출하시오.
df[df['Pclass']==1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [45]:
# 4. Fare 열 값이 20이상 50미만인 자료만 추출하시오.
df[(df['Fare'] >= 20) & (df['Fare'] < 50)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [48]:
# https://finance.yahoo.com/?guccounter=1
# 005930.KS.csv
# 2024년도 삼성전자 주가데이터를 가져온 다음 아래와 같은 작업을 수행하시오.
df = pd.read_csv('005930.KS.csv')
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146 entries, 0 to 145
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       146 non-null    object
 1   Open       146 non-null    float64
 2   High       146 non-null    float64
 3   Low        146 non-null    float64
 4   Close      146 non-null    float64
 5   Adj Close  146 non-null    float64
 6   Volume     146 non-null    int64
dtypes: float64(5), int64(1), object(1)
memory usage: 8.1+ KB

,Open,High,Low,Close,Adj Close,Volume
count,146.000000,146.000000,146.000000,146.000000,146.000000,1.460000e+02
mean,78221.917808,78910.273973,77397.945205,78101.369863,77688.079998,1.997184e+07
std,4278.615521,4352.640569,4182.813262,4342.206436,4534.466818,8.073201e+06
min,71600.000000,72000.000000,70700.000000,71000.000000,70364.968750,2.957915e+06
25%,74300.000000,74850.000000,73500.000000,74150.000000,73486.794922,1.466569e+07
50%,78050.000000,78700.000000,77100.000000,77600.000000,77255.429688,1.872289e+07
75%,81100.000000,81575.000000,80475.000000,81275.000000,80939.000000,2.286587e+07
max,88500.000000,88800.000000,87100.000000,87800.000000,87800.000000,5.769127e+07

In [88]:
# 1) 각 열 단위로 최대값을 출력하시오.
df.max()

Date         2024-08-02
Open            88500.0
High            88800.0
Low             87100.0
Close           87800.0
Adj Close       87800.0
Volume         57691266
dtype: object

In [59]:
# 2) 각 열 단위로 최소값을 출력하시오.
df.min()

Date          2024-01-02
Open             71600.0
High             72000.0
Low              70700.0
Close            71000.0
Adj Close    70364.96875
Volume           2957915
dtype: object

In [100]:
# 3) 각 열 단위로 최대값-최소값을 출력하시오.
df[df.max()-df.min()]

TypeError: unsupported operand type(s) for -: 'str' and 'str'

In [65]:
# 4) 기술통계를 구하시오.
df.describe()

,Open,High,Low,Close,Adj Close,Volume
count,146.000000,146.000000,146.000000,146.000000,146.000000,1.460000e+02
mean,78221.917808,78910.273973,77397.945205,78101.369863,77688.079998,1.997184e+07
std,4278.615521,4352.640569,4182.813262,4342.206436,4534.466818,8.073201e+06
min,71600.000000,72000.000000,70700.000000,71000.000000,70364.968750,2.957915e+06
25%,74300.000000,74850.000000,73500.000000,74150.000000,73486.794922,1.466569e+07
50%,78050.000000,78700.000000,77100.000000,77600.000000,77255.429688,1.872289e+07
75%,81100.000000,81575.000000,80475.000000,81275.000000,80939.000000,2.286587e+07
max,88500.000000,88800.000000,87100.000000,87800.000000,87800.000000,5.769127e+07